capsule_app_api/app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."created_at" ASC
---
  def index
    @items = Item.all

INSERT INTO "items" ("category", "image", "created_at", "updated_at", "selected") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", ""], ["image", "https://i.imgur.com/qxr0RaZ.png"], ["created_at", "2020-02-08 19:45:24.982168"], ["updated_at", "2020-02-08 19:45:24.982168"], ["selected", false]]
---
  def create
    @item = Item.new(item_params)

    if @item.save

UPDATE "items" SET "image" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["image", "https://i.imgur.com/NKFWU81.png"], ["updated_at", "2020-02-08 19:35:15.897358"], ["id", 1]]
---
  def update
    if @item.update(item_params)